todo/app/controllers/api/todos_controller.rb

  def index
    render json: Todolist.all
---
SELECT "todolists".* FROM "todolists"

  def create
    @todo = Todolist.new(todo_params)
    if @todo.save
---
INSERT INTO "todolists" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "blah"], ["body", "hope this works"], ["done", false], ["created_at", "2018-10-02 22:05:19.037370"], ["updated_at", "2018-10-02 22:05:19.037370"]]

  def update
    @todo = Todolist.find_by_id(params[:id])
    if @todo.update(todo_params)
---
SELECT  "todolists".* FROM "todolists" WHERE "todolists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "todolists" SET "done" = $1, "updated_at" = $2 WHERE "todolists"."id" = $3  [["done", true], ["updated_at", "2018-10-03 00:11:49.099560"], ["id", 6]]

  def destroy
    @todo = Todolist.find_by_id(params[:id])
    id = @todo.id
    @todo.delete
---
SELECT  "todolists".* FROM "todolists" WHERE "todolists"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "todolists" WHERE "todolists"."id" = $1  [["id", 3]]